# Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

k = input('введите 3-хзначное число: ')
a = int(k[0])
b = int(k[1])
c = int(k[2])
print('сумма цифр трехзначного числа равна', a + b + c)