# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод:                                       Вывод:
# пара-ра-рам рам-пам-папам па-ра-па-дам      Парам пам-пам

import os
os.system('clear')


def rhyme(verse):
    arr = []
    for phrase in verse:
        temp = list(filter(lambda simb: simb in 'уеыаоэяию', phrase))
        summa = len(temp)
        arr.append(summa)
    if len(set(arr)) > 1:
        print('Пам парам')
    else:
        print('Парам пам-пам')


verse = input("введите стих: ").lower().split()
rhyme(verse)
